# CableTraySettings Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CableTraySettings Class
Members See Also
---
The cable tray settings.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public class CableTraySettings : Element
```

Visual Basic
---
```text
Public Class CableTraySettings _
	Inherits Element
```

Visual C++
---
```text
public ref class CableTraySettings : public Element
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB.Electrical..::..CableTraySettings
# See Also
CableTraySettings Members
Autodesk.Revit.DB.Electrical Namespace